app/controllers/posts_controller.rb

INSERT INTO "posts" ("body", "title", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["body", "My body"], ["title", "My Title"], ["created_at", "2017-02-12 12:57:46.322464"], ["updated_at", "2017-02-12 12:57:46.322464"]]
---
  	def create
    	@post = Post.new(post_params)
      	if @post.save